research/research.org
#+TITLE: TempleOS: Research and Discussion
#+AUTHOR: Robert Coffey
#+DATE: December 11, 2020

#+LATEX_HEADER: \usepackage[parfill]{parskip}
#+LATEX_HEADER: \usepackage{tgbonum}
#+LATEX_HEADER: \usepackage{xurl}

#+MACRO: NEWPAGE @@html:<br>@@ @@latex:\newpage@@

#+LATEX: \pagenumbering{gobble}
{{{NEWPAGE}}}
#+LATEX: \pagenumbering{roman}

* Preface

This document contains my research on TempleOS, as well as its creator Terry
Davis. For a more formal compilation of this research, see the final report in
the =report/= directory.

Much of the final report was paraphrased or copied over from this document. This
document is formatted to make the text easier to scan, as opposed to a nicer
read from top to bottom.

Additionally, this document includes more thorough references than the final
report, providing greater direction for further research.

This document was generated using Emacs Org-Mode, and is ideally viewed in the
=plaintext= format; although =pdf= and =html= formats have also been included.

* Outline

The following table is contains the project requirements obtained from the
project prompt.

|-----------------------+------------------------------|
| Research Requirements | Discussion Topics            |
|-----------------------+------------------------------|
| Running Architecture  | Evolution of TempleOS        |
| Process Scheduling    | Future of TempleOS           |
| Memory Management     | TempleOS in the OS Landscape |
| User Interface        |                              |
|-----------------------+------------------------------|

The following information has been obtained from the personal website of Terry
Davis, the creator of TempleOS. Links to referenced webpages will be provided.

Some additional info, such as Terry Davis calling TempleOS "God's Third Temple",
was not stated explicitly on his website, but instead within the vast collection
of videos he released discussing programming, operating systems, and his life.

{{{NEWPAGE}}}
#+LATEX: \pagenumbering{arabic}

* Research

** Introduction to TempleOS

The following quote was obtained from the TempleOS documentation Welcome page,
written by Terry Davis. This is his summary of TempleOS in a single sentence.

#+BEGIN_QUOTE
TempleOS is a =x86_64=, multi-cored, non-preemptive multi-tasking, ring-0-only,
single-address-mapped (identity-mapped), operating system for recreational
programming. -- Terry Davis [1]
#+END_QUOTE

TempleOS is built with simplicity in mind, it was written with the goal of
keeping the line count down, to make it easy for programmers to tinker with. [1]

For a conventional general purpose OS, failure is not an option. This is not a
problem for TempleOS, as it is intended to be used alongside Windows or Linux.
Failure is an option: if something isn't available in TempleOS, use your other
OS instead. [1]

This allowed Terry to cherry-pick what features to add, with the intent of
keeping TempleOS maximally beautiful. [1]

{{{NEWPAGE}}}

** Running Architecture

TempleOS is intended to run on modern x86 64-bit processors. It is generally
dual-booted alongside a more powerful OS, or run inside a virtual machine. [2]

Although it can be used independently, TempleOS has no networking. [2] This
leads to projects in TempleOS having a workflow involving the usage of programs
in both TempleOS and another OS.

TempleOS was written completely from scratch, even the bootloader and
compiler. [2] This is not a C compiler, it is a compiler for Terry's own
language, HolyC.

Terry created his own programming language, a dialect of C named HolyC. HolyC
can be compiled using Just-in-Time as well as Ahead-of-Time compilation. [2]

HolyC programs can be input directly into the terminal, behaving like a shell
scripting language, or saved in a file and compiled into an executable,
similarly to a traditional C program. [2]

TempleOS uses HolyC for the majority of its kernel code, but also as
its shell scripting language, relieving programmers from having to memorize an
additional language that provides little use outside of the shell. [1]

All processes in TempleOS are known as ring-0-only, meaning there is no kernel
and user mode nor special memory space for the kernel. TempleOS never switches
privilege levels, nor changes address maps. [1]

This simplicity gives TempleOS the ability to switch tasks at far greater speeds
than traditional operating systems. [3]

Having only kernel mode poses many dangers, as one misdirected pointer could
crash the system. But this is not much of a concern for TempleOS, as it is
intended for recreational programming. [1]

In fact the resulting simplicity of allowing the programmer to operate without
protection is largely the purpose of TempleOS. [1]

{{{NEWPAGE}}}

** Process Scheduling

TempleOS is a multi-cored, non-preemptive multi-tasking operating system. [1] It
does master-slave asymmetric multiprocessing. [4]

=Core0= is the master, the master core's processes explicitly assign tasks to
other cores. The TempleOS scheduler does not move tasks between cores, nor does
it preempt any tasks. [4] This is very similar to the First-Come-First-Serve
scheduling algorithm, with the master core behaving as the scheduler.

In TempleOS, each core has a Seth Task that is immortal and is the father of all
tasks on that core. [4] The Adam Task, or Adam, refers to the Seth Task on the
master core. Adam is the father of all the other Seth Tasks, and begins
executing at start-up. [1]

#+BEGIN_QUOTE
Each core has an executive Seth Task which is the father of all tasks on that
core. Adam is the Seth Task on =Core0=. -- Terry Davis [4]

In TempleOS, Adam Task refers to the father of all tasks. He's never supposed to
die. -- Terry Davis [1]

This is Adam, as in Adam and Eve, the parent of all tasks. -- Terry Davis [6]
#+END_QUOTE

Every Seth Task including Adam has a queue of processes with the Seth Task as
the head, each executed as a non-preemptive round-robin queue. [5]

In TempleOS there is only one address map per core, making context switches
orders of magnitude faster than conventional operating systems. [3] The TempleOS
kernel takes advantage of this by utilizing extra threads for helping to render
windows. [4]

Through a process called ~Spawn~, the kernel can dispatch tasks to other cores
and retrieve their results with ease. [4]

{{{NEWPAGE}}}

