research/research.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-11 Fri 23:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TempleOS: Research and Discussion</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Robert Coffey" />
</head>
<body>
<div id="content">
<h1 class="title">TempleOS: Research and Discussion</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4bd6559">1. Preface</a></li>
<li><a href="#org69a11d0">2. Outline</a></li>
<li><a href="#org4c956fe">3. Research</a>
<ul>
<li><a href="#orgd134ff6">3.1. Introduction to TempleOS</a></li>
<li><a href="#org9e9e1e9">3.2. Running Architecture</a></li>
<li><a href="#org24981c7">3.3. Process Scheduling</a></li>
<li><a href="#orgba4c3f0">3.4. Memory Management</a></li>
<li><a href="#org69bd92b">3.5. User Interface</a></li>
</ul>
</li>
<li><a href="#org7e81b39">4. Discussion</a>
<ul>
<li><a href="#org68690f0">4.1. Evolution of TempleOS</a></li>
<li><a href="#org44917d1">4.2. Future of TempleOS</a></li>
<li><a href="#org5afb137">4.3. TempleOS in the OS Landscape</a></li>
</ul>
</li>
<li><a href="#org3254e4e">5. References</a></li>
</ul>
</div>
</div>
<p>
<br>
</p>

<div id="outline-container-org4bd6559" class="outline-2">
<h2 id="org4bd6559"><span class="section-number-2">1</span> Preface</h2>
<div class="outline-text-2" id="text-1">
<p>
This document contains my research on TempleOS, as well as its creator Terry
Davis. For a more formal compilation of this research, see the final report in
the <code>report/</code> directory.
</p>

<p>
Much of the final report was paraphrased or copied over from this document. This
document is formatted to make the text easier to scan, as opposed to a nicer
read from top to bottom.
</p>

<p>
Additionally, this document includes more thorough references than the final
report, providing greater direction for further research.
</p>

<p>
This document was generated using Emacs Org-Mode, and is ideally viewed in the
<code>plaintext</code> format; although <code>pdf</code> and <code>html</code> formats have also been included.
</p>
</div>
</div>

<div id="outline-container-org69a11d0" class="outline-2">
<h2 id="org69a11d0"><span class="section-number-2">2</span> Outline</h2>
<div class="outline-text-2" id="text-2">
<p>
The following table is contains the project requirements obtained from the
project prompt.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Research Requirements</th>
<th scope="col" class="org-left">Discussion Topics</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Running Architecture</td>
<td class="org-left">Evolution of TempleOS</td>
</tr>

<tr>
<td class="org-left">Process Scheduling</td>
<td class="org-left">Future of TempleOS</td>
</tr>

<tr>
<td class="org-left">Memory Management</td>
<td class="org-left">TempleOS in the OS Landscape</td>
</tr>

<tr>
<td class="org-left">User Interface</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
The following information has been obtained from the personal website of Terry
Davis, the creator of TempleOS. Links to referenced webpages will be provided.
</p>

<p>
Some additional info, such as Terry Davis calling TempleOS "God's Third Temple",
was not stated explicitly on his website, but instead within the vast collection
of videos he released discussing programming, operating systems, and his life.
</p>

<p>
<br>
</p>
</div>
</div>

<div id="outline-container-org4c956fe" class="outline-2">
<h2 id="org4c956fe"><span class="section-number-2">3</span> Research</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd134ff6" class="outline-3">
<h3 id="orgd134ff6"><span class="section-number-3">3.1</span> Introduction to TempleOS</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The following quote was obtained from the TempleOS documentation Welcome page,
written by Terry Davis. This is his summary of TempleOS in a single sentence.
</p>

<blockquote>
<p>
TempleOS is a <code>x86_64</code>, multi-cored, non-preemptive multi-tasking, ring-0-only,
single-address-mapped (identity-mapped), operating system for recreational
programming. &#x2013; Terry Davis [1]
</p>
</blockquote>

<p>
TempleOS is built with simplicity in mind, it was written with the goal of
keeping the line count down, to make it easy for programmers to tinker with. [1]
</p>

<p>
For a conventional general purpose OS, failure is not an option. This is not a
problem for TempleOS, as it is intended to be used alongside Windows or Linux.
Failure is an option: if something isn't available in TempleOS, use your other
OS instead. [1]
</p>

<p>
This allowed Terry to cherry-pick what features to add, with the intent of
keeping TempleOS maximally beautiful. [1]
</p>

<p>
<br>
</p>
</div>
</div>

<div id="outline-container-org9e9e1e9" class="outline-3">
<h3 id="org9e9e1e9"><span class="section-number-3">3.2</span> Running Architecture</h3>
<div class="outline-text-3" id="text-3-2">
<p>
TempleOS is intended to run on modern x86 64-bit processors. It is generally
dual-booted alongside a more powerful OS, or run inside a virtual machine. [2]
</p>

<p>
Although it can be used independently, TempleOS has no networking. [2] This
leads to projects in TempleOS having a workflow involving the usage of programs
in both TempleOS and another OS.
</p>

<p>
TempleOS was written completely from scratch, even the bootloader and
compiler. [2] This is not a C compiler, it is a compiler for Terry's own
language, HolyC.
</p>

<p>
Terry created his own programming language, a dialect of C named HolyC. HolyC
can be compiled using Just-in-Time as well as Ahead-of-Time compilation. [2]
</p>

<p>
HolyC programs can be input directly into the terminal, behaving like a shell
scripting language, or saved in a file and compiled into an executable,
similarly to a traditional C program. [2]
</p>

<p>
TempleOS uses HolyC for the majority of its kernel code, but also as
its shell scripting language, relieving programmers from having to memorize an
additional language that provides little use outside of the shell. [1]
</p>

<p>
All processes in TempleOS are known as ring-0-only, meaning there is no kernel
and user mode nor special memory space for the kernel. TempleOS never switches
privilege levels, nor changes address maps. [1]
</p>

<p>
This simplicity gives TempleOS the ability to switch tasks at far greater speeds
than traditional operating systems. [3]
</p>

<p>
Having only kernel mode poses many dangers, as one misdirected pointer could
crash the system. But this is not much of a concern for TempleOS, as it is
intended for recreational programming. [1]
</p>

<p>
In fact the resulting simplicity of allowing the programmer to operate without
protection is largely the purpose of TempleOS. [1]
</p>

<p>
<br>
</p>
</div>
</div>

<div id="outline-container-org24981c7" class="outline-3">
<h3 id="org24981c7"><span class="section-number-3">3.3</span> Process Scheduling</h3>
<div class="outline-text-3" id="text-3-3">
<p>
TempleOS is a multi-cored, non-preemptive multi-tasking operating system. [1] It
does master-slave asymmetric multiprocessing. [4]
</p>

<p>
<code>Core0</code> is the master, the master core's processes explicitly assign tasks to
other cores. The TempleOS scheduler does not move tasks between cores, nor does
it preempt any tasks. [4] This is very similar to the First-Come-First-Serve
scheduling algorithm, with the master core behaving as the scheduler.
</p>

<p>
In TempleOS, each core has a Seth Task that is immortal and is the father of all
tasks on that core. [4] The Adam Task, or Adam, refers to the Seth Task on the
master core. Adam is the father of all the other Seth Tasks, and begins
executing at start-up. [1]
</p>

<blockquote>
<p>
Each core has an executive Seth Task which is the father of all tasks on that
core. Adam is the Seth Task on <code>Core0</code>. &#x2013; Terry Davis [4]
</p>

<p>
In TempleOS, Adam Task refers to the father of all tasks. He's never supposed to
die. &#x2013; Terry Davis [1]
</p>

<p>
This is Adam, as in Adam and Eve, the parent of all tasks. &#x2013; Terry Davis [6]
</p>
</blockquote>

<p>
Every Seth Task including Adam has a queue of processes with the Seth Task as
the head, each executed as a non-preemptive round-robin queue. [5]
</p>

<p>
In TempleOS there is only one address map per core, making context switches
orders of magnitude faster than conventional operating systems. [3] The TempleOS
kernel takes advantage of this by utilizing extra threads for helping to render
windows. [4]
</p>

<p>
Through a process called <code>Spawn</code>, the kernel can dispatch tasks to other cores
and retrieve their results with ease. [4]
</p>

<p>
<br>
</p>
</div>
</div>
