research/research.org
** Memory Management

Tasks inherit the symbols of parent, thus everything that must be system-wide is
associated with Adam. [1]

Since Adam is immortal, on Adam's heap go all memory objects which are not to be
destroyed by any single task's death. [6]

#+BEGIN_QUOTE
TempleOS identity-maps all memory, all the time. It is like paging is not
used. There is no special kernel high half memory space. -- Terry Davis [2]

TempleOS is ring-0-only, so everything is kernel, even user programs. There is a
special task called Adam and he doesn't die, so his heap never gets
freed. That's as close to kernel memory as it gets. -- Terry Davis [2]
#+END_QUOTE

In TempleOS there is no distinction between a task, process, or thread. Each
task has a code and data heap which is returned to its parent Seth Task when it
dies. [6]

TempleOS has no concept of kernel and user memory, all memory can be accessed by
any process. [2]

TempleOS imposes no protection over memory, which can be dangerous as much like
with kernel mode, one misdirected pointer could crash the system. [1]

{{{NEWPAGE}}}

** User Interface

TempleOS exclusively displays in the 640x480 resolution with 16-bit color. [1]

TempleOS has a screen refresh rate of 30000/1001 frames-per-second. This is how
often TempleOS updates screen memory, and is not synchronized with hardware. [2]

TempleOS has its own 2D and 3D sprite format, 3D sprites are stored as a mesh of
triangles. [2]

All text files in TempleOS can store sprites directly in the file. This is done
by storing binary sprite data beyond the terminating NULL in the file. [2]

Adam is created at start-up and appears in a small window always available
beneath the user's windows. [6]

There can be only one window per task, and only tasks on the master core can
have windows. [6] Although other cores may help the master core render them. [4]

{{{NEWPAGE}}}

* Discussion

** Evolution of TempleOS

TempleOS is just the most recent in a line of hand-rolled operating systems
written by Terry Davis. Around 1993, Terry got a 486 processor and was eager to
try 32-bit mode; so he wrote a DOS program in TASM that changed to protected
mode and never returned to DOS. [7]

This program was called "Terry's Protected Mode OS", TPMOS. This name was
inspired by the machines he worked on at the time, which used the "VAXTMOS"
operating system. For all intents and purposes, TPMOS is the root of TempleOS'
ancestry. [7]

TPMOS never got much further than 0xB8000 text mode, echoing the keyboard to
screen, simple multitasking, and what was barely a ~malloc~. [7] But it marked
the beginning of what would become Terry's greatest work.

TPMOS was set aside for some time, until 2003 when it was resurrected. Terry
used FreeDOS and Visual Studo to compile and execute it, and continued building
the OS from there. Around this time he had started a company "H.A.R.E.", and
renamed TPMOS to HOPPY. [7]

Next came the challenge of building a proper command line. Terry wanted it to
use the same scripting language as he would be creating for the OS. Fueled by
hatred for bash scripting, Terry created HolyC: an amalgamation of some helpful
Pascal syntax, with the power of C and C++. [2] Giving users a language that can
be used for both controlling the command line, as well as writing programs.

#+BEGIN_QUOTE
The only problem was, I hated Unix Bash scripting. I could never remember it. As
a regular C/C++ programmer, you don't really use bash often enough to memorize
it. I thought, "What if I just use C/C++ for scripting!" -- Terry Davis [7]
#+END_QUOTE

{{{NEWPAGE}}}

Terry suffered from issues related to mental health throughout his life, but
sometime after 2003, his mental health began to decline drastically. He suffered
from hallucinations of God, paranoia about the CIA, and became obsessed with his
operating system. His hallucinations guided his work. He took upon a mission
from what he thought was God: *To create a divine operating system.*

#+BEGIN_QUOTE
In 2003, God told me to stick to 640x480 16 color. -- Terry Davis [7]

I didn't start the operating system as a work for God, but He directed my path
along the way and kept saying it was His temple. -- Terry Davis [7]
#+END_QUOTE

His operating system took on multiple names: Doors, Davos, J, LoseThos,
SparrowOS, and finally, TempleOS. Along the way he wrote his own bootloaders,
compiler, and every other program in TempleOS, abandoning DOS entirely. [7]

#+BEGIN_QUOTE
Still I hesistated and kept it secular until, finally, Microsoft went nuclear
with SecureBoot and UEFI. Then, I went nuclear and named it "TempleOS". I will
command them on orders from God to UNDO THAT STUFF! -- Terry Davis [7]
#+END_QUOTE

That leaves us with the TempleOS of today, known by Terry Davis as God's
Third Temple.

{{{NEWPAGE}}}

** Future of TempleOS

Terry was the sole programmer of TempleOS, having written the entire thing from
scratch; all the way down to the bootloader. [2] Unfortunately, Terry ended his
own life in 2018. Without his vision and genius, TempleOS lacks direction.

His project lives on through people like myself, who take interest in his work
and who he was, but there is little hope for seeing it continue to develop.
TempleOS was and is entirely Terry, this was his idea of how a computer should
function.

Without Terry, changing TempleOS would be like vandalism. Using TempleOS feels
like you're experiencing a personal space, seeing old ideas and the growth of
someone that can only be called a Grand Wizard; someone who endured the woes of
uncontrollable intellect that a Grand Wizard would be expected to.

** TempleOS in the OS Landscape

TempleOS was built with programmers, and the Commodore 64, in mind. Having been
inspired by how accessible it was to program the C64: Terry designed his
platform to minimize the obstacles between the programmer and their compiler.

Although there is little commercial use for TempleOS, it provides a unique
platform for tinkerers to have free reign over their machine. Something that
just isn't possible in an OS which is to be used by businesses and for critical
operations. TempleOS will never run on a hospital network, but it will give you
total freedom as a programmer.

Through a combination of the scripting environment provided by the TempleOS
command line, and HolyC: programmers can build useful programs with the
performance of a compiled language, and the workflow creature comforts of an
interpreted language such as UNIX bash.

{{{NEWPAGE}}}

