research/research.html

<div id="outline-container-orgba4c3f0" class="outline-3">
<h3 id="orgba4c3f0"><span class="section-number-3">3.4</span> Memory Management</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Tasks inherit the symbols of parent, thus everything that must be system-wide is
associated with Adam. [1]
</p>

<p>
Since Adam is immortal, on Adam's heap go all memory objects which are not to be
destroyed by any single task's death. [6]
</p>

<blockquote>
<p>
TempleOS identity-maps all memory, all the time. It is like paging is not
used. There is no special kernel high half memory space. &#x2013; Terry Davis [2]
</p>

<p>
TempleOS is ring-0-only, so everything is kernel, even user programs. There is a
special task called Adam and he doesn't die, so his heap never gets
freed. That's as close to kernel memory as it gets. &#x2013; Terry Davis [2]
</p>
</blockquote>

<p>
In TempleOS there is no distinction between a task, process, or thread. Each
task has a code and data heap which is returned to its parent Seth Task when it
dies. [6]
</p>

<p>
TempleOS has no concept of kernel and user memory, all memory can be accessed by
any process. [2]
</p>

<p>
TempleOS imposes no protection over memory, which can be dangerous as much like
with kernel mode, one misdirected pointer could crash the system. [1]
</p>

<p>
<br>
</p>
</div>
</div>

<div id="outline-container-org69bd92b" class="outline-3">
<h3 id="org69bd92b"><span class="section-number-3">3.5</span> User Interface</h3>
<div class="outline-text-3" id="text-3-5">
<p>
TempleOS exclusively displays in the 640x480 resolution with 16-bit color. [1]
</p>

<p>
TempleOS has a screen refresh rate of 30000/1001 frames-per-second. This is how
often TempleOS updates screen memory, and is not synchronized with hardware. [2]
</p>

<p>
TempleOS has its own 2D and 3D sprite format, 3D sprites are stored as a mesh of
triangles. [2]
</p>

<p>
All text files in TempleOS can store sprites directly in the file. This is done
by storing binary sprite data beyond the terminating NULL in the file. [2]
</p>

<p>
Adam is created at start-up and appears in a small window always available
beneath the user's windows. [6]
</p>

<p>
There can be only one window per task, and only tasks on the master core can
have windows. [6] Although other cores may help the master core render them. [4]
</p>

<p>
<br>
</p>
</div>
</div>
</div>

<div id="outline-container-org7e81b39" class="outline-2">
<h2 id="org7e81b39"><span class="section-number-2">4</span> Discussion</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org68690f0" class="outline-3">
<h3 id="org68690f0"><span class="section-number-3">4.1</span> Evolution of TempleOS</h3>
<div class="outline-text-3" id="text-4-1">
<p>
TempleOS is just the most recent in a line of hand-rolled operating systems
written by Terry Davis. Around 1993, Terry got a 486 processor and was eager to
try 32-bit mode; so he wrote a DOS program in TASM that changed to protected
mode and never returned to DOS. [7]
</p>

<p>
This program was called "Terry's Protected Mode OS", TPMOS. This name was
inspired by the machines he worked on at the time, which used the "VAXTMOS"
operating system. For all intents and purposes, TPMOS is the root of TempleOS'
ancestry. [7]
</p>

<p>
TPMOS never got much further than 0xB8000 text mode, echoing the keyboard to
screen, simple multitasking, and what was barely a <code>malloc</code>. [7] But it marked
the beginning of what would become Terry's greatest work.
</p>

<p>
TPMOS was set aside for some time, until 2003 when it was resurrected. Terry
used FreeDOS and Visual Studo to compile and execute it, and continued building
the OS from there. Around this time he had started a company "H.A.R.E.", and
renamed TPMOS to HOPPY. [7]
</p>

<p>
Next came the challenge of building a proper command line. Terry wanted it to
use the same scripting language as he would be creating for the OS. Fueled by
hatred for bash scripting, Terry created HolyC: an amalgamation of some helpful
Pascal syntax, with the power of C and C++. [2] Giving users a language that can
be used for both controlling the command line, as well as writing programs.
</p>

<blockquote>
<p>
The only problem was, I hated Unix Bash scripting. I could never remember it. As
a regular C/C++ programmer, you don't really use bash often enough to memorize
it. I thought, "What if I just use C/C++ for scripting!" &#x2013; Terry Davis [7]
</p>
</blockquote>

<p>
<br>
</p>

<p>
Terry suffered from issues related to mental health throughout his life, but
sometime after 2003, his mental health began to decline drastically. He suffered
from hallucinations of God, paranoia about the CIA, and became obsessed with his
operating system. His hallucinations guided his work. He took upon a mission
from what he thought was God: <b>To create a divine operating system.</b>
</p>

<blockquote>
<p>
In 2003, God told me to stick to 640x480 16 color. &#x2013; Terry Davis [7]
</p>

<p>
I didn't start the operating system as a work for God, but He directed my path
along the way and kept saying it was His temple. &#x2013; Terry Davis [7]
</p>
</blockquote>

<p>
His operating system took on multiple names: Doors, Davos, J, LoseThos,
SparrowOS, and finally, TempleOS. Along the way he wrote his own bootloaders,
compiler, and every other program in TempleOS, abandoning DOS entirely. [7]
</p>

<blockquote>
<p>
Still I hesistated and kept it secular until, finally, Microsoft went nuclear
with SecureBoot and UEFI. Then, I went nuclear and named it "TempleOS". I will
command them on orders from God to UNDO THAT STUFF! &#x2013; Terry Davis [7]
</p>
</blockquote>

<p>
That leaves us with the TempleOS of today, known by Terry Davis as God's
Third Temple.
</p>

<p>
<br>
</p>
</div>
</div>

<div id="outline-container-org44917d1" class="outline-3">
<h3 id="org44917d1"><span class="section-number-3">4.2</span> Future of TempleOS</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Terry was the sole programmer of TempleOS, having written the entire thing from
scratch; all the way down to the bootloader. [2] Unfortunately, Terry ended his
own life in 2018. Without his vision and genius, TempleOS lacks direction.
</p>

<p>
His project lives on through people like myself, who take interest in his work
and who he was, but there is little hope for seeing it continue to develop.
TempleOS was and is entirely Terry, this was his idea of how a computer should
function.
</p>

<p>
Without Terry, changing TempleOS would be like vandalism. Using TempleOS feels
like you're experiencing a personal space, seeing old ideas and the growth of
someone that can only be called a Grand Wizard; someone who endured the woes of
uncontrollable intellect that a Grand Wizard would be expected to.
</p>
</div>
</div>

<div id="outline-container-org5afb137" class="outline-3">
<h3 id="org5afb137"><span class="section-number-3">4.3</span> TempleOS in the OS Landscape</h3>
<div class="outline-text-3" id="text-4-3">
<p>
TempleOS was built with programmers, and the Commodore 64, in mind. Having been
inspired by how accessible it was to program the C64: Terry designed his
platform to minimize the obstacles between the programmer and their compiler.
</p>

<p>
Although there is little commercial use for TempleOS, it provides a unique
platform for tinkerers to have free reign over their machine. Something that
just isn't possible in an OS which is to be used by businesses and for critical
operations. TempleOS will never run on a hospital network, but it will give you
total freedom as a programmer.
</p>

<p>
Through a combination of the scripting environment provided by the TempleOS
command line, and HolyC: programmers can build useful programs with the
performance of a compiled language, and the workflow creature comforts of an
interpreted language such as UNIX bash.
</p>

<p>
<br>
</p>
</div>
</div>
</div>
