research/research.org
* References

1. Terry Davis. /Welcome to TempleOS./
   [[https://templeos.holyc.xyz/Wb/Doc/Welcome.html]]

2. Terry Davis. /Frequently Asked Questions./
   [[https://templeos.holyc.xyz/Wb/Doc/FAQ.html]]

3. Terry Davis. /TempleOS' Features./
   [[https://templeos.holyc.xyz/Wb/Doc/Features.html]]

4. Terry Davis. /Multi-Core./
   [[https://templeos.holyc.xyz/Wb/Doc/MultiCore.html]]

5. Terry Davis. /Scheduler./
   [[https://templeos.holyc.xyz/Wb/Kernel/Sched.html]]

6. Terry Davis. /Glossary./
   [[https://templeos.holyc.xyz/Wb/Doc/Glossary.html]]

7. Terry Davis. /TempleOS History./
   [[https://templeos.holyc.xyz/Wb/Home/Web/History.html]]
