research/research.html

<div id="outline-container-org3254e4e" class="outline-2">
<h2 id="org3254e4e"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Terry Davis. <i>Welcome to TempleOS.</i>
<a href="https://templeos.holyc.xyz/Wb/Doc/Welcome.html">https://templeos.holyc.xyz/Wb/Doc/Welcome.html</a></li>

<li>Terry Davis. <i>Frequently Asked Questions.</i>
<a href="https://templeos.holyc.xyz/Wb/Doc/FAQ.html">https://templeos.holyc.xyz/Wb/Doc/FAQ.html</a></li>

<li>Terry Davis. <i>TempleOS' Features.</i>
<a href="https://templeos.holyc.xyz/Wb/Doc/Features.html">https://templeos.holyc.xyz/Wb/Doc/Features.html</a></li>

<li>Terry Davis. <i>Multi-Core.</i>
<a href="https://templeos.holyc.xyz/Wb/Doc/MultiCore.html">https://templeos.holyc.xyz/Wb/Doc/MultiCore.html</a></li>

<li>Terry Davis. <i>Scheduler.</i>
<a href="https://templeos.holyc.xyz/Wb/Kernel/Sched.html">https://templeos.holyc.xyz/Wb/Kernel/Sched.html</a></li>

<li>Terry Davis. <i>Glossary.</i>
<a href="https://templeos.holyc.xyz/Wb/Doc/Glossary.html">https://templeos.holyc.xyz/Wb/Doc/Glossary.html</a></li>

<li>Terry Davis. <i>TempleOS History.</i>
<a href="https://templeos.holyc.xyz/Wb/Home/Web/History.html">https://templeos.holyc.xyz/Wb/Home/Web/History.html</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: December 11, 2020</p>
<p class="author">Author: Robert Coffey</p>
<p class="date">Created: 2020-12-11 Fri 23:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
